run/BM3/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.01;

x_min -8;
x_max  8;
y_min  0;
y_max  1;  
z_min -8;
z_max  8;

vertices
(
    ( $x_min  $y_min  $z_min ) // 0  
    ( $x_max  $y_min  $z_min ) // 1  
    ( $x_max  $y_max  $z_min ) // 2  
    ( $x_min  $y_max  $z_min ) // 3
    ( $x_min  $y_min  $z_max ) // 4
    ( $x_max  $y_min  $z_max ) // 5
    ( $x_max  $y_max  $z_max ) // 6
    ( $x_min  $y_max  $z_max ) // 7
);

/* EB: in this case (x,z) forms the horizontal plane while
   the y-axis is oriented against the gravitational force */
blocks
(
    hex (0 1 2 3 4 5 6 7) (32 2 32) simpleGrading (1 1 1) 
 )   
edges
(
);

boundary
(
    lowerWall
    {
        type wall;
        faces
	  (
            (0 1 5 4) // EB: clockwise order seen from the hex inside 
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (0 4 7 3) //<--
            (0 3 2 1) //<--
            (1 2 6 5)
            (4 5 6 7) 
            (2 3 7 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
